rails/ThermalRails/app/controllers/companies_controller.rb

  def getall
    companies = Company.all;
    arr = Array.new
    companies.each{ |company|
      netTotal = company.votes.where(vote_type: "up_vote").count - company.votes.where(vote_type: "down_vote").count
---
SELECT "companies".* FROM "companies"
SELECT COUNT(*) FROM "votes" WHERE "votes"."company_id" = ? AND "votes"."vote_type" = 'up_vote'  [["company_id", 1]]

  def voteInfo
    @company = Company.find_by(name: params[:name])
    trendingArray = recentTrendingArray(@company)
    rankingArray = recentRankingArray(@company)
    votes = Hash.new
    votes["up_votes"] = @company.votes.where(vote_type: "up_vote").count
---
SELECT "companies".* FROM "companies" WHERE "companies"."name" = 'soundcloud' LIMIT 1
SELECT COUNT(*) FROM "votes" WHERE "votes"."company_id" = ? AND (vote_type = 'up_vote' AND created_at <= '2014-04-29 22:32:12.117742' AND created_at >= '2014-04-28 22:32:12.117779')  [["company_id", 1]]