rails/ThermalRails/app/controllers/companies_controller.rb

SELECT COUNT(*) FROM "companies"
SELECT "companies".* FROM "companies" ORDER BY name ASC LIMIT 14 OFFSET 0
---
  def index
    @companies = Company.all.paginate(params).order("created_at desc")
    arr = Array.new
    @companies.each{ |company|

INSERT INTO "companies" ("created_at", "img_url", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 22 Apr 2014 22:33:01 UTC +00:00], ["img_url", "https://www.facebook.com/images/fb_icon_325x325.png"], ["name", "facebook"], ["updated_at", Tue, 22 Apr 2014 22:33:01 UTC +00:00]]
---
  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save

SELECT "companies".* FROM "companies" WHERE "companies"."name" = 'Facebook' LIMIT 1
---
  def lookup
    @company = Company.find_by(name: params[:name])

SELECT "companies".* FROM "companies" WHERE "companies"."name" = 'snapchat' LIMIT 1
INSERT INTO "companies" ("created_at", "img_url", "name", "updated_at") VALUES (?, ?, ?, ?)
INSERT INTO "votes" ("company", "company_id", "created_at", "updated_at", "vote_type") VALUES (?, ?, ?, ?, ?)  [["company", "snapchat"], ["company_id", 4], ["created_at", Fri, 18 Apr 2014 23:08:06 UTC +00:00], ["updated_at", Fri, 18 Apr 2014 23:08:06 UTC +00:00], ["vote_type", "up_vote"]]
---
  def vote
    @company = Company.find_by(name: params[:name])

    vote = Vote.new
    vote.company = params[:name]
    vote.vote_type = params[:vote_type]
    vote.vote_location = params[:vote_location]

    if !@company.nil?
      @company.votes << vote

SELECT "companies".* FROM "companies" WHERE "companies"."name" = 'snapchat' LIMIT 1
SELECT "votes".* FROM "votes" WHERE "votes"."company_id" = ? AND "votes"."vote_type" = 'up_vote'  [["company_id", 1]]
---
  def voteLookup
    @company = Company.find_by(name: params[:name])
    vote_type = params[:vote_type]
    respond_to do |format|
      format.html { redirect_to @company}
      if vote_type.nil?
        format.json { render json: @company.votes }
      else
        format.json {render json: @company.votes.where(vote_type: vote_type)}

SELECT "companies".* FROM "companies" WHERE "companies"."name" = 'snapchat' LIMIT 1
SELECT COUNT(*) FROM "votes" WHERE "votes"."company_id" = ? AND (vote_type = 'up_vote' AND created_at <= '2014-04-29 18:58:39.078232')  [["company_id", 2]]
---
  def voteCount
    @company = Company.find_by(name: params[:name])
    votes = Hash.new
    votes["up_votes"] = @company.votes.where(vote_type: "up_vote").count